dimaf405/H743_FreeRTOS/Dima/platform/stm32h7/system/Clock.cpp
#include "stm32h7/HardwareServices.hpp"

#include "api/platform_config.h"

#include "stm32h7xx_hal.h"

namespace dima::platform::stm32h7 {
namespace {

constexpr std::uint32_t kTimerFrequencyHz = 1000000U;
constexpr std::uint32_t kExpectedTimerInputClockHz = 240000000U;

/* TIM2 以 1 MHz 自由运行：PSC = 240 MHz / 1 MHz - 1 = 239，单 tick 为 1 us。
 * 32-bit CNT 每约 4294.967296 s 回绕，overflow_high 将其扩展为 64-bit 单调时间。 */
class Stm32Clock final : public MonotonicClock {
public:
    bool initialize() noexcept
    {
        if (initialized_) {
            return true;
        }
        const std::uint32_t timer_clock = timer_input_clock_hz();
        if (timer_clock != kExpectedTimerInputClockHz ||
            timer_clock < kTimerFrequencyHz ||
            (timer_clock % kTimerFrequencyHz) != 0U) {
            return false;
        }

        __HAL_RCC_TIM2_CLK_ENABLE();
        TIM2->CR1 = 0U;
        TIM2->CR2 = 0U;
        TIM2->SMCR = 0U;
        TIM2->DIER = 0U;
        TIM2->CCMR1 = 0U;
        TIM2->CCMR2 = 0U;
        TIM2->CCER = 0U;
        TIM2->CCR1 = 0U;
        TIM2->PSC = timer_clock / kTimerFrequencyHz - 1U;
        TIM2->ARR = UINT32_MAX;
        TIM2->CNT = 0U;
        TIM2->EGR = TIM_EGR_UG;
        TIM2->SR = 0U;

        overflow_high_ = 0U;
        sequence_ = 0U;
        NVIC_SetPriority(TIM2_IRQn, DIMA_MAX_SYSCALL_INTERRUPT_PRIORITY);
        NVIC_ClearPendingIRQ(TIM2_IRQn);
        NVIC_EnableIRQ(TIM2_IRQn);
        TIM2->DIER = TIM_DIER_UIE;
        TIM2->CR1 = TIM_CR1_CEN;
        initialized_ = true;
        return true;
    }

    bool initialized() const noexcept override { return initialized_; }

    TimeUs now_us() const noexcept override
    {
        if (!initialized_) {
            return 0U;
        }
        std::uint32_t sequence_before;
        std::uint32_t sequence_after;
        std::uint32_t high;
        std::uint32_t low;
        std::uint32_t status;
        /* sequence 是轻量 seqlock：ISR 更新前后各递增一次，读者只接受相同偶数
         * 序号。若 UIF 已置位但 ISR 尚未执行，读者本地补偿 high，覆盖回绕窗口。 */
        do {
            sequence_before = sequence_;
            __DMB();
            high = overflow_high_;
            low = TIM2->CNT;
            status = TIM2->SR;
            __DMB();
            sequence_after = sequence_;
        } while (sequence_before != sequence_after ||
                 (sequence_before & 1U) != 0U);

        if ((status & TIM_SR_UIF) != 0U) {
            ++high;
            low = TIM2->CNT;
        }
        return (static_cast<TimeUs>(high) << 32U) | low;
    }

    void overflow_isr() noexcept
    {
        if ((TIM2->SR & TIM_SR_UIF) == 0U) {
            return;
        }
        /* 奇数表示写入中，偶数表示稳定；DMB 固定 high 与序号的可见顺序。 */
        ++sequence_;
        __DMB();
        TIM2->SR = ~TIM_SR_UIF;
        ++overflow_high_;
        __DMB();
        ++sequence_;
    }

private:
    static std::uint32_t timer_input_clock_hz() noexcept
    {
        RCC_ClkInitTypeDef clocks{};
        std::uint32_t flash_latency = 0U;
        HAL_RCC_GetClockConfig(&clocks, &flash_latency);
        const std::uint32_t pclk = HAL_RCC_GetPCLK1Freq();
        return clocks.APB1CLKDivider == RCC_APB1_DIV1 ? pclk : pclk * 2U;
    }

    volatile std::uint32_t overflow_high_{0U};
    volatile std::uint32_t sequence_{0U};
    bool initialized_{false};
};

Stm32Clock &instance() noexcept
{
    static Stm32Clock value;
    return value;
}

} // namespace

bool clock_initialize() noexcept { return instance().initialize(); }
MonotonicClock &clock() noexcept { return instance(); }

} // namespace dima::platform::stm32h7

extern "C" void dima_hrt_overflow_isr(void)
{
    static_cast<dima::platform::stm32h7::Stm32Clock &>(
        dima::platform::stm32h7::clock()).overflow_isr();
}
